<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"azurerm","backend":"957c984d5a2dcced2eca6d7831c22ceb01316be96dd23f63aadf9ad16aeb5b8d","plan_job_ref":"Job Terraform PRs for Azure #13 at https://github.com/acm-uic/IaC/actions/runs/4401789704","plan_hash":"4509b61dfe5b31aa1d41122f28c1172f4548a9d82bbdab5c1b507ef46e0f9a5b","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan in __azure/terraform/stacks/acm-general__ in the __prod__ workspace
With var files: `azure/terraform/stacks/acm-general/configuration/prod.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_role_assignment.terraform_sysadmin_demo_dns will be created
  + resource "azurerm_role_assignment" "terraform_sysadmin_demo_dns" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "************************************"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = "/subscriptions/2f98793b-7e2f-4f03-ac5b-7b2ec934dcd7"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.terraform_sysadmin_demo_reader will be created
  + resource "azurerm_role_assignment" "terraform_sysadmin_demo_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "************************************"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/2f98793b-7e2f-4f03-ac5b-7b2ec934dcd7"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform PRs for Azure #13](https://github.com/acm-uic/IaC/actions/runs/4401789704)